{
  "videos": [

      {
          "id": "1",
          "categoria": "FRONT END",
          "titulo": "Métricas para o Front-end com Mário Souto",
          "imagem": "https://i.ytimg.com/vi/iVNR-6v8lZU/maxresdefault.jpg",
          "url": "https://www.youtube.com/watch?v=iVNR-6v8lZU",
          "descricao": "Você sabe quais métricas são importantes no Front-End? 🤔 Neste vídeo o Paulo Silveira e o ‪@DevSoutinho‬ batem um papo sobre as métricas que não podem ser esquecidas em um bom site. Se você tá começando a programar ou ainda não sabe quais métricas utilizar no dia a dia, confira o conteúdo e anota as dicas pra colocar em prática. E se você já tem utilizado no seu site métricas incríveis que impactam diretamente na performance, conta pra gente nos comentários, queremos saber 😉✌"
      },
      {
          "id": "2",
          "categoria": "FRONT END",
          "titulo": "O que faz uma desenvolvedora front-end?",
          "imagem": "https://img.youtube.com/vi/ZY3-MFxVdEw/mqdefault.jpg",
          "url": "https://www.youtube.com/watch?v=ZY3-MFxVdEw",
          "descricao": "O que é Front-end? Trabalhando na área os termos HTML, CSS e JavaScript fazem parte da rotina das desenvolvedoras e desenvolvedores. Mas o que eles fazem, afinal? Descubra com a Vanessa nesse episódio! "
      },
      {
          "id": "3",
          "categoria": "FRONT END",
          "titulo": "O que é Front End?",
          "imagem": "https://img.youtube.com/vi/R490hggkCEA/mqdefault.jpg",
          "url": "https://www.youtube.com/watch?v=R490hggkCEA",       
          "descricao": "Quando falamos em programação logo vem o questionamento entre Back End e Front End. Mas afinal, o que é cada uma dessas áreas de conhecimento? 🤔Guilherme Lima e Vinícius Neves, instrutores da Alura trocaram algumas figurinhas e simplificaram para vocês qual a função de cada área e as suas principais diferenças 😃"       
      },
      {
          "id": "4",
          "categoria": "FRONT END",
          "titulo": "Como testar seu Front-end, com Mario Souto | #HipstersPontoTube",
          "imagem": "https://i.ytimg.com/vi/CaTbfdsVydE/sddefault.jpg",
          "url": "https://www.youtube.com/watch?v=CaTbfdsVydE",       
          "descricao":"Por onde começar a testar as habilidades em Front-end? Se você tem dúvidas na hora de testar softwares e colocar em prática técnicas modernas, esse vídeo vai te ajudar. O ‪@DevSoutinho‬ compartilhou dicas pra você testar seu Front-end e como praticar testes desde funcionalidades simples até as mais avançadas. Confere aí e conta pra gente se você está testando suas habilidades nessa área e quais bibliotecas costuma usar ✌😉"
      },
      {
          "id": "5",
          "categoria": "BACK END",
          "titulo": "O que faz uma desenvolvedora Back-end? com Juliana Amoasei",
          "imagem": "https://img.youtube.com/vi/fiPfvylj6rk/mqdefault.jpg",
          "url": "https://www.youtube.com/watch?v=fiPfvylj6rk",       
          "descricao": "Afinal, quem trabalha com Back-end faz o que? Com quais outras áreas da tecnologia essa pessoa acaba se relacionando no dia a dia de trabalho e quais os possíveis caminhos nessa carreira? 🤔A Juliana Amoasei responde tudo isso pra você no vídeo! Confere aí! "
      },
      {
          "id": "6",
          "categoria": "BACK END",
          "titulo": "Kotlin, Micronaut e Back-end com Alberto Sousa",
          "imagem": "https://img.youtube.com/vi/PV9FoHvVE8k/mqdefault.jpg",
          "url": "https://www.youtube.com/watch?v=PV9FoHvVE8k",       
          "descricao": "Vamos falar sobre Kotlin, a linguagem da programação que é amplamente usada por desenvolvedores Android.Dessa vez o @DevEficient nos ajudou a entender quais as vantagens de usar Kotlin e as semelhanças que tem com Java. Vem conferir mais da capacidade dessa linguagem e como usá-la no universo da programação."
      },
      {
          "id": "7",
          "categoria": "BACK END",
          "titulo": "JavaScript para back-end",
          "imagem": "https://img.youtube.com/vi/uyRDbGZG92E/mqdefault.jpg",
          "url": "https://www.youtube.com/watch?v=uyRDbGZG92E",       
          "descricao": "Nesse episódio do Hipsters.Talks vamos conversar sobre a utilização de JavaScript para back-end e conhecer mais sobre sua aplicação no dia a dia de desenvolvimento."
      },
      {
          "id": "8",
          "categoria": "BACK END",
          "titulo": "O que é o C#? #HipstersPontoTube",
          "imagem": "https://i.ytimg.com/vi/0JWMVc1CqpA/maxresdefault.jpg",
          "url": "https://www.youtube.com/watch?v=0JWMVc1CqpA",       
          "descricao": "Paulo, Roberta e mais um bate-papo da websérie Hipsters Ponto Tube! E dessa vez,  a conversa foi sobre a linguagem desenvolvida pela Microsoft como parte da plataforma .NET"
      },
      {
          "id": "9",
          "categoria": "MOBILE",
          "titulo": "Desmistificando Mobile- Por onde eu começo?",
          "imagem": "https://img.youtube.com/vi/2z6f8VN_Pro/mqdefault.jpg",
          "url": "https://www.youtube.com/watch?v=2z6f8VN_Pro",
          "descricao": "Tem série nova no canal 🤩A Websérie “Desmistificando o mobile” vêm aí para simplificar com exemplos práticos vários assuntos envolvendo o mundo dos aplicativos de celular e neste primeiro episódio vamos partir, literalmente, do começo, por onde começar a estudar sobre o mundo dos apps? Os instrutores da escola de mobile da Alura nos ajudam com essa tarefa 😉"
      },
      {
          "id": "10",
          "categoria": "MOBILE",
          "titulo": "Desmitificando Mobile Ep#2",
          "imagem": "https://img.youtube.com/vi/fmu1LQvZhms/mqdefault.jpg",
          "url": "https://www.youtube.com/watch?v=fmu1LQvZhms",
          "descricao":"Segundo episódio no ar! 🥳No segundo episódio da websérie “Desmistificando o mobile” vamos entender um pouco sobre o que é feito após ser inserido no mundo dos apps: conhecer um pouco mais sobre frameworks e linguagens de programação e porque existem diferentes para fazer um aplicativo de celular. Vêm aprender um pouco na companhia do Alex Felipe, da Nathalia Thiel, Giovanna Moeller e do Caio Couto 😉"
      },
      {
          "id": "11",
          "categoria": "MOBILE",
          "titulo": "Nativos: Android e iOS | Desmistificando Mobile Ep#3",
          "imagem": "https://img.youtube.com/vi/9V48oXZdXgQ/mqdefault.jpg",
          "url": "https://www.youtube.com/watch?v=9V48oXZdXgQ",
          "descricao":"Agora que a Helô já que sabe que existem muitas linguagens de programação em mobile e que ela pode escolher qual se encaixa melhor no seu projeto de “como fazer meu primeiro app” ela vai conversar com Alex Felipe, especialista em Android e com a Giovanna Moeller, dev iOS para entender um pouco do mundo dos nativos para desenvolver aplicativos 🤩"
      },
      {
          "id": "12",
          "categoria": "MOBILE",
          "titulo": "Híbridos: Flutter e React Native | Desmistificando Mobile - Ep #4",
          "imagem": "https://i.ytimg.com/vi/vf9P_PycgRw/maxresdefault.jpg",
          "url": "https://www.youtube.com/watch?v=vf9P_PycgRw",
          "descricao":"Depois de entender sobre as linguagens de programação nativas, Helô vai conversar com a Natalia Thiel e o Caio Couto sobre Flutter e React Native, que são linguagens híbridas e que possibilitam outros caminhos para os aplicativos de celular 🤩"
      }
  ] 
}